// Программа приводит к цели, то есть находит два числа "a" и "с" за счет проверки
// на четность и нечетность квадрата числа "b", таким путем она узнает насколько уменьшать "a" и прибавлять 1 или 2 к значению "c".
// таким образом "а" при нечетности "b" становится равна целой половине квадрата "b",
// а "с" на единицу больше. При четности квадрата "b", "a" равна целой четверти квадрата "b",
// а "с" на 2 единицы больше. Таким алгоритмом программа делает числа "a" и "c" близкими по значению к друг другу, а "b" как раз входит в те (1 или 2 единицы()зависимо от четности и нечетности).