// Для положительного целого числа b найти положительные целые числа a и c,
// такие, что a^2 + b^2 = c^2
// Задачу решить без перебора.
begin
    b := 99641;
    number := b * b;

    if (number mod 2 <> 0) then
    begin
        a := number div 2;
        c := a + 1;
    end else begin
        a := ((number div 2) - 1) div 2;
        c := a + 2;
    end;
    writeln(a, ' ** 2 + ', b, ' ** 2 = ', c, ' ** 2');
    writeln(a*a, ' + ', number, ' = ', c * c);
    writeln(a*a + number = c * c);
end.

{нечетное число имеет вид (2*x + 1)
b^2 = (2*x + 1)^2 = 4*x*(x+1)+1, then
  a = number div 2 = 2*x*(x+1), c = 2*x*(x+1) + 1 =>
  c = 2*x^2 + 2*x + 1 ==>
  b^2 = c^2 - a^2 = (2*x^2 + 2*x + 1)^2 - (2*x*(x+1))^2 ==>
  b^2 = (2*x^2 + 2*x +1)^2 - (2*x(x + 1))^2 =
  = (2*x^2 + 2*x + 1 - 2*x^2-2*x)*(2*x^2 + 2*x + 1 + 2*x^2 + 2*x) =
  = 4*x^2 + 4x + 1
  Итого b^2 = (2*x + 1)^2
  Аналогичное верно и для случая, когда b^2 - четное}
